// let varse 
// function Fire(a, b){
//    return a * b
// }


// // console.log(Fire(10,5))
// document.getElementById("bg").style.color = "#00FF00"
// let nuevo = document.getElementsByClassName("bgn")
// nuevo[0].style.backgroundColor = "#98FB98"
// document.querySelector("h1").style.color = "#FF1493"
// // document.write(Fire(10,5))
// console.log(nuevo)


// Задание №1 Вычислить результат 158+2 и вывести значение
// выражения в диалоговое окно.

// function sum(a, b){
//         return(a + b)
// }
// document.write(sum(158, 2))

// Передать строковый параметр в диалоговое окно. Например, вывести «Привет,
// Алевтина!», где имя — это передаваемый параметр

// let privet = prompt("Введите имя:");
// alert (privet)

// Вызвать диалоговое окно с заголовком «Как вас зовут?» и подсказкой
// «Имя» в поле ввода. Затем вывести имя, которое ввели.

// alert("Как вас зовут?")
// let name = prompt("Как вас зовут", "Имя")
// alert (name)

// Написать функцию, выводящую в диалоговом окне текст и переменную. 
//Например, «Привет, Алевтина». Где «Алевтина» — это внешняя переменная.

// let name = "Алевтина"
// function Privet(){
//     alert (`Привет, ${name}`)
// }
// Privet()


// вывести на экран ****в диалоговом окне текст с сообщением “Вы уверены?” 
//и кнопками «ОК» , «Отмена».
// При нажатии на кнопку “ОК” вывести в диалоговом окне текст с сообщением
// “Мы рады, что Вы уверены!”.
// При нажатии на кнопку “Отмена” вывести в диалоговом окне текст
// с сообщением “Жаль, что Вы не уверены…”

// let word = "Вы уверены?"
// if (confirm(word)){
//     alert("Мы рады, что Вы уверены!")
// }
// else{
//     alert("Жаль, что Вы не уверены…")
// }

// Вызвать диалоговое окно с заголовком «Как вас зовут?» и подсказкой
// «Имя» в поле ввода. Затем вывести имя, которое ввели.

// alert("Как вас зовут")
// let myname = prompt("Как вас зовут", "Имя")
// alert (myname)